{
  "initial_greeting": "That mask! So bold, I applaud you good sir!",
  "talked_already": "Ah, it's you.",
  "nodes": {
    "start": {
      "text": "Let's cut the formalities. As an intellect I presume you also know of the mayors new policy.",
      "choices": [
        {
          "text": "What policy are you referring to my good sir?",
          "next": "policy_explanation"
        },
        {
          "text": "Are you referring to the lousy \"Common Man\" act?",
          "next": "dissed_the_common_man_act",
          "set_flag": "common_man_act_dissed"
        },
        {
          "text": "I'm a fart smella, not a smart fella.",
          "next": "not_a_smart_fella",
          "set_flag": "agree_with_common_man_act"
        }
      ]
    },
    "policy_explanation": {
      "text": "Why, it's the \"Common Man\" act. Mandatory 40 hour work week, and an age limit for workers. Set to an astonishing age of 18.",
      "choices": [
        {
          "text": "40 hour work weeks? Age limit for employees?! This mayor is bleeding us dry!",
          "next": "dissed_the_common_man_act",
          "set_flag": "common_man_act_dissed"
        },
        {
          "text": "Doesn't seem too bad. The workers will work harder for the competitive wages, while keeping the youth in school to better prepare for their future careers.",
          "next": "dismissive_common_man_act_response",
          "set_flag": "agree_with_common_man_act"
        }
      ]
    },
    "dissed_the_common_man_act": {
      "text": "Precisely! Does the mayor not understand the gravity of such an act? I'd be losing half my workforce from such an act. Not to mention all the shareholders I'd let down from these mandatory hours.",
      "next": "diss_common_man_act_cont"
    },
    "diss_common_man_act_cont": {
      "text": "This foolish mayor doesn't care for the intellects of society. Someone needs to put him in his place.",
      "next": "talked_previously"
    },
    "lowkey_wants_to_mention_the_frog": {
      "text": "Ha, The Frog... I know it may be uncouth, but I know of his true identity. Would you like to hear?",
      "choices": [
        {
          "text": "Oh, do tell...",
          "next": "reveals_the_frog",
          "set_flag": "frog_identity_revealed"
        },
        {
          "text": "No need, I wouldn't want to ruin the spirit of such an event.",
          "next": "frog_identity_reveal_declined"
        }
      ]
    },
    "frog_identity_reveal_declined": {
      "text": "Ah, that's quite noble. I have nothing but respect for a man like yourself.",
      "next": "talked_previously"
    },
    "reveals_the_frog": {
      "text": "That bumbling oaf of a Frog tripped and stumbled outside, and for a split second his mask came off to reveal that he was the mayors former assistant.",
      "choices": [
        {
          "text": "Former assistant? What happened.",
          "next": "why_is_he_former"
        },
        {
          "text": "Of course it'd be the lousy frog to reveal himself at such an event.",
          "next": "hating_on_the_frog"
        }
      ]
    },
    "why_is_he_former": {
      "text": "Who's to say. I hear he's one of us tho, hates the mayor and what he stands for.",
      "choices": []
    },
    "talked_previously": {
      "text": "Now, do tell, was there anything you'd like to ask?",
      "choices": [
        {
          "text": "Why are you here?",
          "next": "why_is_he_here"
        },
        {
          "text": "The Tiki is the mayors son",
          "next": "tiki_dialogue",
          "colored": "true",
          "set_flag": "tiki_betrayal",
          "condition": {
            "state": "true",
            "flag": "tiki_mayor_son"
          }
        },
        {
          "text": "Nothing. I'll be on my way.",
          "next": "end"
        },
        {
          "text": "That Frog doesn't really seem fit for parties.",
          "next": "lowkey_wants_to_mention_the_frog",
          "colored": "true",
          "condition": {
            "state": "true",
            "flag": "frog_talked_to"
          }
        },
        {
          "text": "That policy we spoke of earlier, what was it again?",
          "next": "policy_explanation"
        }
      ],
      "condition": {
        "state": "false",
        "flag": "agree_with_common_man_act"
      },
      "else": "hater_cuz_common_man_act_enjoyer"
    },
    "hating_on_the_frog": {
      "text": "Haha, why I'd agree. I heard he's against the mayor, one of us. To think we'd have him on our side, it's quite laughable.",
      "next": "talked_previously"
    },
    "dismissive_common_man_act_response": {
      "text": "Bah, of all our guests I'd expect someone such as you to understand such a complex policy. I expected too much from you. Begone!",
      "choices": []
    },
    "hater_cuz_common_man_act_enjoyer": {
      "text": "I thought you'd be wiser. I do not wish to speak to such a simpleton. Begone!",
      "choices": []
    },
    "why_is_he_here": {
      "text": "While I do hate the mayor, it's hard to deny that amount of power that appears at events such as these. You never know when the next big idea could be broadcasted at such an event, and when it is, I will be the one to capitalize on it.",
      "next": "talked_previously"
    },
    "tiki_dialogue": {
      "text": "Interesting. His son should be up at university now, but to see him at an event leads me to believe he is no longer attending. Why he was probably caught being a vagrant and was kicked out. You know what they say, the apple doesn't fall far from the tree.",
      "choices": []
    },
    "end": {
      "text": "Good luck to you sir.",
      "choices": []
    },
    "not_a_smart_fella": {
      "text": "Come again? Are you mocking me? Why, how rude. To think such low life would be at an event like this. Begone with you.",
      "choices": []
    }
  }
}
